<!-- add-pr-comment:add-pr-comment -->

## Terraform plan
```
Acquiring state lock. This may take a few moments...
digitalocean_container_registry.webb_and_wallace_container_registry: Refreshing state... [id=webb-and-wallace-container-registry]
digitalocean_kubernetes_cluster.billtime_k8s_cluster: Refreshing state... [id=6f7acc3c-2f93-4397-8acc-11bd8ab963bf]
digitalocean_project.billtime_project: Refreshing state... [id=d22a987c-4dde-403c-88c6-626158f67c1c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_container_registry_docker_credentials.webb_and_wallace_container_registry_docker_credentials will be created
  + resource "digitalocean_container_registry_docker_credentials" "webb_and_wallace_container_registry_docker_credentials" {
      + credential_expiration_time = (known after apply)
      + docker_credentials         = (sensitive value)
      + expiry_seconds             = 1576800000
      + id                         = (known after apply)
      + registry_name              = "webb-and-wallace-container-registry"
      + write                      = false
    }

  # kubernetes_secret.k8s_container_registry_config will be created
  + resource "kubernetes_secret" "k8s_container_registry_config" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "kubernetes.io/dockerconfigjson"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "docker-cfg"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```